{
  "backend/main.mo": "Minimal Motoko backend entry point defining an empty actor with no methods.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (Lucide icon replacement, multi-accent color palette, glassmorphism card redesign) to their affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-sentence summaries of each frontend source file, serving as a build planning reference for the project's components and styles.",
  "frontend/index.css": "Base Tailwind CSS entry with OKLCH CSS custom property tokens for light and dark themes covering background, foreground, card, border, and chart colors.",
  "frontend/index.html": "Minimal HTML shell for the React app, setting the page title to 'unaIITM' and mounting the app at the #root div via main.tsx.",
  "frontend/src/App.tsx": "Root React component that composes Navbar, Hero, QuickAccess, MessMenu, Events, Notices, and Footer within a deep forest-green radial gradient background.",
  "frontend/src/components/Events.tsx": "Events section rendering five glassmorphism cards with category badges, Lucide icons, and hover effects, opening a premium Modal with full event details on click.",
  "frontend/src/components/Footer.tsx": "App footer with gradient logo, navigation anchor links, copyright year, and a caffeine.ai attribution link with a Heart icon and UTM tracking.",
  "frontend/src/components/Hero.tsx": "Full-viewport hero section featuring ambient glow orbs, a gradient 'unaIITM' heading, feature tag chips, dual CTA buttons, and a scroll indicator.",
  "frontend/src/components/MessMenu.tsx": "Renders a 'Mess Menu' section displaying breakfast, lunch, and dinner cards in a horizontal scroll row, each with meal items, timing, and hover animations.",
  "frontend/src/components/Navbar.tsx": "Sticky navigation bar with a logo, desktop nav links, and a mobile hamburger menu that toggles a dropdown with the same links.",
  "frontend/src/components/Notices.tsx": "Displays campus notices as horizontally scrollable cards with priority indicators, opening a modal with full notice details on click.",
  "frontend/src/components/QuickAccess.tsx": "Renders a row of quick-access tiles (timetable, attendance, library, etc.) that open a BottomPanel with detailed content when clicked.",
  "frontend/src/components/shared/BottomPanel.tsx": "A reusable slide-up bottom sheet overlay with a backdrop, header with title/icon, close button, and scrollable content area.",
  "frontend/src/components/shared/HorizontalScrollRow.tsx": "A reusable horizontally scrollable container with snap scrolling, hidden scrollbar, and configurable gap and padding props.",
  "frontend/src/components/shared/Modal.tsx": "A reusable centered modal overlay with a blurred backdrop, header with optional icon and title, close button, and scrollable content area.",
  "frontend/src/components/shared/SectionHeader.tsx": "Reusable React section header component that renders a title, optional subtitle, a colored accent bar, and a gradient underline, supporting emerald, amber, and teal accent themes.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/index.css": "Global stylesheet defining CSS custom properties for the forest-green/glassmorphism design system, Tailwind base/component/utility layers, and reusable classes like glass-card, gradient-text, and canopy-texture.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with forest-green/amber/teal color palette, Inter and Playfair Display fonts, glassmorphism shadows, and custom keyframe animations.",
  "project_state.json": "Project state manifest (version 7) documenting the unaIITM campus platform's architecture, design theme, existing features, and section breakdown for build planning purposes."
}